test/containOuterDistance_moveDynamicMesh/original/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontWall
    {
        type            fixedFluxPressure;
	value 		uniform 0;
    }
  backWall
    {
        type            fixedFluxPressure;
	value 		uniform 0;
    }
  bottom
    {
        type            fixedFluxPressure;
	value 		uniform 0;
    }
    symmetryWall
      {
	type symmetryPlane;
      }

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }

    wec
    {
        type            fixedFluxPressure;
    }
    inlet
    {
	type 		fixedFluxPressure; 
	value		uniform 0; 	
    }	
    outlet
    {
	type 		fixedFluxPressure;
	value 		uniform 0; 
    }

}

// ************************************************************************* //
